{
  "navigation": {
    "noelRaffle": "Noel Raffle",
    "giftRaffle": "Gift Raffle",
    "sponsors": "Sponsor",
    "statistics": "Site Statistics",
    "home": "Home",
    "about": "About"
  },
  "page": {
    "noel": {
      "title": "Noel Raffle",
      "slogan": "New Year is a fresh start. It's time to leave the past behind and step into tomorrow filled with new hopes. Look forward with optimism, explore the beauties of life, and share them with your loved ones. May the New Year bring you happiness, health, and success! 🌟 🎉",
      "description": "Add the participants and complete the draw. We will generate random pairings for you and send you the participant for whom you need to receive a gift to your email address. Happy New Year in advance! ✨"
    },
    "gift": {
      "title": "Gift Raffle",
      "slogan": "The most beautiful way to further enrich the special moments in life is to touch our loved ones with surprise gifts. Exchanging gifts not only strengthens emotional bonds but also remains one of the sweetest ways to share love. 🌟 🎉",
      "description": "First, add the gifts and then the participants, and complete the draw. We will make random selections for you and notify the lucky participants by email about the gift they have won. Wishing everyone the best of luck in advance. ✨"
    },
    "place": {
      "startRaffle": "Start Raffle",
      "addParticipants": "Add Participants",
      "completeRaffle": "Complete Raffle",
      "raffleTitle": "Raffle Title",
      "raffleTitlePlaceholder": "E.g.: Alice's HR Team @Company",
      "chooseRaffleGroup": "Choose Raffle Group",
      "teamCompany": "Team - Company",
      "friendsClassmates": "Friends - Class",
      "family": "Family - Relatives",
      "other": "Other",
      "chooseSector": "Choose Sector",
      "technology": "Technology",
      "education": "Education",
      "food": "Food",
      "health": "Health",
      "sport": "Sports",
      "minimumParticipants": "Add at least 3 participants",
      "participantAdded": "Successfully added; Add the next participant. 🎅🏻",
      "addFirstParticipant": "Add the first participant. 🎅🏻",
      "name": "Name",
      "participantNamePlaceholder": "Participant Name",
      "surname": "Surname",
      "participantSurnamePlaceholder": "Participant Surname",
      "email": "Email",
      "participantEmailPlaceholder": "Participant Email",
      "emailAlreadyTaken": "You've already used this email for this raffle.",
      "dontWorry": "Don't worry if you make a mistake! In the next step, you can edit and delete participants. ✨",
      "maximumParticipant": "The number of participants cannot exceed 500",
      "somethingWentWrong": "Something went wrong",
      "checkAndCompleteRaffle": "Check your participant list and complete the raffle. 🎅🏻",
      "checkAndCompleteGiftRaffle": "Check your participant and gift list and complete the raffle. ✨",
      "confidentialityAgreement": "Confidentiality Agreement",
      "userAgreement": "User Agreement",
      "readAndAccept": "I have read and accept.",
      "successfullyMessage": "Raffle successfully completed. Please check your emails.",
      "addFirstGift": "Add the first gift. 🎁",
      "giftAdded": "successfully added; Add the next gift. ✨",
      "dontWorryGift": "Don't worry if you make a mistake! In the last step, you can edit and delete gifts. ✨",
      "minimumGifts": "Add at least 1 gifts.",
      "minimumGiftCount": "The number of gifts cannot be less than 1.",
      "giftName": "Gift Name",
      "giftCount": "Gift Count",
      "addGifts": "Add Gifts",
      "clickShowParticipantTable": "Click to show or hide participant table below",
      "clickShowGiftTable": "Click to show or hide gift table below",
      "noelRaffleCount": "Noel Raffle Count",
      "giftRaffleCount": "Gift Raffle Count",
      "participantCount": "Participant Count",
      "givenGiftCount": "Given Gift Count",
      "totalRaffleCount": "Total Raffle Count",
      "untilNow": "Until Now Total",
      "projectTitle": "Our Code is Free, Our Love is Infinite!",
      "projectDescription": "The codes of this platform are open source, and you can contribute to the development of the project. The technologies used are listed below.",
      "clickProjectSite": "Please click to visit the project page.",
      "projectTechStack": "Tech Stack: Next.js, Material UI, Java, Spring Boot, Spring Data, MySQL, RabbitMq, etc.",
      "aboutDeveloper": "About the Developer",
      "kursatsimsek": "Kursat Simsek | Full-Stack Developer - Detaysoft",
      "clickCoffeeLink": "Click here to buy coffee for the developer.",
      "userAgreementParagraph": "Dear visitor, please carefully read this terms of use agreement before visiting our website. Your access to the site is entirely dependent on your acceptance of this agreement and compliance with the terms set forth in this agreement. If you do not accept any condition stated in this agreement, please terminate your access to the site. By continuing to access the site, you will be deemed to have unconditionally and unrestrictedly accepted the entire text of this agreement. This website is managed by Kürşat Şimşek and will hereinafter be referred to as the 'SITE.' These Terms of Use for the site come into effect upon publication. The right to make changes belongs solely to the SITE, and all users are considered to have accepted these changes, which will be shared on the SITE, from the beginning. Privacy Privacy, regulating the principles of processing your personal data by us, is available on a separate page. By using the SITE, you acknowledge that the processing of this data is carried out in accordance with the privacy policy. Scope of Service As Kürşat Şimşek, we are entirely free to determine the scope and nature of the services we provide within the framework of the law. Any changes to the services we provide will come into effect when published on the SITE. Copyright All text, code, graphics, logos, images, audio files, and software used on the SITE (hereinafter referred to as 'content') are owned by Kürşat Şimşek, and all rights are reserved. Reproduction or copying of site content without written permission is strictly prohibited. General Provisions All users undertake to use the SITE only for legal and personal purposes and commit not to engage in any activity that would infringe on the rights of third parties. The SITE is not directly or indirectly liable for the legal and criminal responsibilities of users for their actions and transactions on the SITE. We make every effort to ensure the accuracy and currency of the information available on the SITE. However, despite our efforts, this information may lag behind actual changes, and there may be some differences. Therefore, we do not provide any explicit or implicit warranty regarding the accuracy and currency of the information on the SITE, and no commitment is made. The SITE may contain hyperlinks to other websites, applications, and platforms operated by third parties, the content of which is unknown to us. The SITE only facilitates access to these sites, and we do not accept any responsibility for their content. While we strive to keep the SITE free of viruses, we do not guarantee the complete absence of viruses. Therefore, it is the responsibility of users to take necessary precautions against viruses or other malicious programs when downloading data. We do not guarantee that the services offered on the SITE will be free of defects or errors, or that uninterrupted service will be provided. We may terminate your access to the SITE or any part of the site at any time without prior notice. Limitation of Liability Our liability for damages arising from the use of the SITE is limited to intent and gross negligence. In case of a breach of the contract, the total compensation that can be claimed is limited to foreseeable damages. The above-mentioned liability limitations do not apply in the case of harm to human life, bodily injury, or damage to a person's health. In cases considered legally force majeure, we will have no liability for delay, non-performance, or default. Dispute Resolution: In the resolution of any dispute arising from the application or interpretation of this Agreement, the laws of the Republic of Turkey apply; Sivas Courts and Enforcement Offices are authorized.",
      "confidentialityAgreementParagraph": "Your security is important to us. Therefore, the personal data you share with us is carefully protected. As the data controller, Kürşat Şimşek, with this privacy and personal data protection policy, aims to inform you about which personal data will be processed for what purpose, with whom and why the processed data may be shared, our data processing methods and legal reasons, and your rights regarding the processed data. Your Collected Personal Data, Collection Method, and Legal Basis Your IP address and user agent information will be processed automatically or non-automatically through technologies such as cookies, solely for the purpose of analysis. They will be processed, recorded, stored, and updated within the scope and duration of our service and contract relationship, based on the legitimate interest processing condition. Purpose of Processing Your Personal Data The personal data you share with us will only be processed for analysis to best fulfill the requirements of the services we offer, ensuring access to these services by you, enabling maximum benefit, developing our services in line with your needs, and bringing you together with more comprehensive service providers within legal frameworks. It will be processed and updated in a manner appropriate to the purpose during the contract and service period. To Whom and for What Purposes Your Collected Personal Data May Be Transferred Your personal data may be transferred to third parties, both domestically and internationally, including but not limited to third parties with whom we have contractual relationships, cooperate, and cooperate, and to judicial and administrative authorities upon request, provided that the necessary technical and administrative measures are taken. Your Rights as the Data Subject As per Article 11 of the Personal Data Protection Law, everyone can use the following rights by applying to the data controller: Learning whether personal data is processed, Requesting information if personal data is processed, Learning the purpose of processing personal data and whether they are used in accordance with their purpose, Knowing the third parties to whom personal data is transferred, domestically or internationally, Requesting correction of personal data if it is incomplete or incorrectly processed, Requesting the deletion or destruction of personal data, Requesting the notification of the transactions made pursuant to subparagraphs (e) and (f) to third parties to whom personal data is transferred, Objecting to the occurrence of a result against the person by analyzing the processed data exclusively through automated systems, In case personal data is processed unlawfully and a damage occurs due to this processing, requesting the compensation of the damage. You are completely free to accept or reject the processing of your personal data, which is necessary for us to provide you with services and conduct analyses for service purposes, in accordance with this privacy and personal data processing policy. If you continue to use the site, it will be assumed that you have accepted it, and please feel free to contact us via kursatsimsek@protonmail.ch for more detailed information."
    },
    "button": {
      "back": "Back",
      "next": "Next",
      "add": "Add",
      "edit": "Edit",
      "save": "Save",
      "delete": "Delete",
      "newRaffle": "New Raffle"
    }
  }
}
